{
  "de": [
    {
      "title": "Software Engineer",
      "company": "ISTA (Festanstellung)",
      "description": "Beim Ista Projekt in Essen handelt es sich um eine Webanwendung für Heizkostenabrechung usw. Entwicklung mit Microfrontend Architektur in BE Entwicklung Java Microservices mit  Spring Boot. Erstellung von CI/CD pipelines. Entwerfen von Rest Schnittstellen, Verwendung von Krakend als API Gateway. Verwalten kubernetes pods deployments, services usw.",
      "time": "Seit November 2020",
      "points": "Angular, Java, Javascript, Microservices, Angular 11, kubernetes, postgresql, Gitlab, ci-cd, Microfrontend, KrakenD, JMS, Active-MQ"
    },
    {
      "title": "Fullstack developer",
      "company": "P&C (Festanstellung)",
      "description": "Beim P&C Projekt in Düsseldorf handelt es sich um eine in CRM Plattform. Im Frontend kommen React zum Einsatz. Die komplexen Transaktion(Events) prozesse werden über Event Sourcing Technologien bearbeitet. Für die einzelnen Prozessschritte werden Scala mit Akka Framework zur Verfügung gestellt. Die Kommunikation zwischen den jeweiligen Schichten erfolgt über REST aufrufe.",
      "time": "1 Jahr 2 Monaten Mai 2018 - Juny 2019",
      "points": "Scala, Akka, kubernetes, Microservices, wavefront, postgresql, Amazon Web Services, ElasticSearch, Mongodb"
    },
    {
      "title": "Senior Software Entwickler",
      "company": "Toyota Kreditbank (Externe)",
      "description": "Beim Toyota Kreditbank Projekt handelt es sich um eine Java-Swing Application für die Mitarbeiter des Bank. Umsetzung von Designanforderungen Anbindung von stored Procedures Erstellen von SQL-Abfragen",
      "time": "4 Monaten February 2018 - Mai 2018",
      "points": "Java, Java-Swing, jquery, Oracle, spring, GIT"
    },
    {
      "title": "Software Entwickler",
      "company": "Brainbits (Externe)",
      "description": "Entwicklung von ein JIRA Time tracking Plugin. Erstellung und Anbindung von REST Schnittstellen Abholung und Verarbeitung von CSV Dateien und Erstellung von Periodischen JIRA Services im Bereich JIRA. Plugin Erstellung von Datenstrukturen und Tabellen in PostgreSQL-9.4 Datenbanken. Erstellung HTML Seiten und Email Templates (insb. Closure- und Velocity- Templates)",
      "time": "3 Monaten December 2017 - February 2018",
      "points": "Java, atlassian sdk, jquery, velocity, closure, postgresql, html, css, js"
    },
    {
      "title": "Junior Java Entwickler",
      "company": "Check24 (Festanstellung)",
      "time": "2 Jahre 6 Monaten, Mai 2015 - October 2017",
      "description": "Aufnahme der fachlichen Anforderungen.Implementierung und Entwicklung(Inkl Oberflächen) Buildmanagement.Erstellung von Datenstrukturen, Datenbanktabellen und Datenmigrationswerkzeugen(Flyway), inklusive Oracle 12DB, Elasticsearch.Erstellung und Anbindung von Rest, Spring Remoting Schnittstellen.Erweiterung der Anbindung externer Dienstleister.",
      "points": "jee, Java8, spring4, oracle, velocity, html, js, git, oracle, rest, sql, groovy, hibernate, elasticsearch, design patterns"
    },
    {
      "title": "Praktikant Java/JEE-Entwickler",
      "company": "Treelogics Software Services GmbH (Praktikant)",
      "time": "9 Monaten, Juli 2014 - März 2015",
      "description": "Agile Entwicklung und Konzeptioniertung eines Crm Verwaltungstools für das Erasmus Plus Mobility for Placements.Implementierung und Entwicklung Java BE, Java FE(Java server faces)",
      "points": "java, jpa, jsf, oracle, websocket, maven, subversion, ecliipse, gwt, agile"
    }
  ]
}